# 4. Пользователь вводит целое положительное число. Найдите самую большую цифру в числе.
# Для решения используйте цикл while и арифметические операции.
# user_number = int(input("Введите число: "))
#
# print(user_number%10)
# print(user_number//10)
# print("")
# while user_number > 10:
#     number = user_number % 10
#     if number < user_number:
#         user_number = user_number // 10
#         max_number = user_number
#     else:
#         max_number = number
# print(max_number)




